function [isOk, DWord] = CheckCRC(EWord)
% Р¤СѓРЅРєРёС†СЏ РѕСЃСѓС‰РµСЃС‚РІР»СЏРµС‚ РїСЂРѕРІРµСЂРєСѓ CRC РґР»СЏ РѕРґРЅРѕРіРѕ СЃР»РѕРІР° РЅР°РІРёРіР°С†РёРѕРЅРЅРѕРіРѕ
% СЃРѕРѕР±С‰РµРЅРёСЏ

% РќР° РІС…РѕРґРµ:
%   EWord - СЃР»РѕРІРѕ (СЃС‚СЂРѕРєР°) СЃ РґРІСѓРјСЏ Р±РёС‚Р°РјРё РїСЂРµРґС‹РґСѓС‰РµРіРѕ СЃР»РѕРІР° РІ РЅР°С‡Р°Р»Рµ, С‚.Рµ.
%     РІСЃРµРіРѕ 32 Р±РёС‚Р°.

% РќР° РІС‹С…РѕРґРµ: 
%   isOk - 1, РµСЃР»Рё CRC СЃС…РѕРґРёС‚СЃСЏ, 0 РІ РїСЂРѕС‚РёРІРЅРѕРј СЃР»СѓС‡Р°Рµ.
%   DWord - РґРµРєРѕРґРёСЂРѕРІР°РЅРЅРѕРµ СЃР»РѕРІРѕ (СЃС‚СЂРѕРєР°), С‚.Рµ. РІСЃРµРіРѕ 24 Р±РёС‚Р°.
    isOk = 0;
    if (EWord(2) == 1)
        d = mod(EWord(3:26) + 1,2);
    else
        d = EWord(3:26);
    end
    D(1) = mod(sum([EWord(1) d([1, 2, 3, 5, 6, 10, 11, 12, 13, 14, 17, 18, 20, 23])]), 2);
    D(2) = mod(sum([EWord(2), d([2, 3, 4, 6, 7, 11, 12, 13, 14, 15, 18, 19, 21, 24])]), 2);
    D(3) = mod(sum([EWord(1), d([1, 3, 4, 5, 7, 8, 12, 13, 14, 15, 16, 19, 20, 22])]), 2);
    D(4) = mod(sum([EWord(2), d([2, 4, 5, 6, 8, 9, 13, 14, 15, 16, 17, 20, 21, 23])]), 2);
    D(5) = mod(sum([EWord(2), d([1, 3, 5, 6, 7, 9, 10, 14, 15, 16, 17, 18, 21, 22, 24])]), 2);
    D(6) = mod(sum([EWord(1), d([3, 5, 6, 8, 9, 10, 11, 13, 15, 19, 22, 23, 24])]), 2);
    
    if (D == EWord(27:32))
        isOk = 1;
    end
    DWord = EWord(3:26);
end